{
    "nav": {
        "portfolio": "PORTFOLIO",
        "about": "ABOUT",
        "resume": "RESUME",
        "artstation": "ARTSTATION",
        "contact": "CONTACT"
    },
    "style_bar_text": "I'm a curious and ambitious game developer driven to create games that are not only fun through their mechanics but also grounded in meaningful themes—whether narrative, cultural, historical, or emotional. While I’m still early in my journey, I’m committed to learning every aspect of game development step by step, with the goal of one day building something truly impactful to me, player community or the world.",
    "portfolio": {
        "title": "PORTFOLIO",
        "card_1": {
        "title": "Toymare",
        "genre": "Genre: Action + Puzzle",
        "description": "A 3D horror game where you play as a child who has to escape from a haunted toy factory.",
        "button": "View More"
        },
        "card_2": {
        "title": "Grub Bug",
        "genre": "Genre: Action + Puzzle",
        "description": "A 3D horror game where you play as a child who has to escape from a haunted toy factory.",
        "button": "View More"
        }
    },
    "about": {
        "title": "ABOUT ME",
        "p1": "Hi! I’m Jacky, a 21-year-old rising junior majoring in Information Science at Cornell University. I’m deeply passionate about interactive technology, especially game design, which I’m pursuing as a minor. I bring six years of experience in art and design, two years in programming, and one year specifically focused on game development.",
        "p2": "For a long time, I was uncertain about my career path. I wasn’t sure what kind of impact I wanted to make—whether it was educational, emotional, or simply bringing joy to others. Over time, I’ve come to realize that video games, often called the ninth art, are a powerful medium that blends diverse disciplines to convey meaningful experiences. This realization gave me purpose.",
        "p3": "Interestingly, I used to dislike programming—my early struggles with Scratch shook my confidence. But through game development, I found the motivation to overcome those fears and embrace coding as a creative tool. I will tirelessly keep learning new skills and technologies to help me go further on my path as a game developer.",
        "p4": "Outside of academics and projects, I love playing games, traveling, and cooking. Traveling, in particular, inspires me. It exposes me to different cultures and perspectives, often sparking ideas for my design and game projects."
    },
    "footer": {
        "copyright": "Copyright © 2024, Jacky Pan. All rights reserved."
    },
    "language_menu": {
        "english": "English",
        "chinese": "简体中文",
        "cantonese": "繁体中文"
    },
    
    "game1": {
        "info": {
            "title": "Info",
            "role": {
                "label": "Role:",
                "value": "Programmer, UI/UX Lead, Game Designer, Project"
            },
            "engine": {
                "label": "Engine/Framework:",
                "value": "IntelliJ, Git, LibGDX (Java)"
            },
            "team": {
                "label": "Team:",
                "value": "Fachoi Studio — SP25 INFO/CS 3152 Intro to Game"
            },
            "timeline": {
                "label": "Timeline:",
                "value": "Jan 21 2025 - May 17th 2025"
            }
        },
        "intro" : {
            "title": "The Game",
            "text": "In a busy delivery warehouse, Nox the delivery cat was sorting packages as usual—until a strange energy swept through, bringing every parcel to life. Now, chaotic creatures are wreaking havoc, and it’s up to Nox to stop them! As Nox, the diligent delivery cat, players must fend off the rebellious parcels by quickly assembling and combining scattered toy parts to form powerful constructs. Use strategy, timing, and quick thinking to restore order to the warehouse and ensure every package gets delivered on time."
        },
        "game_design" : {
            "title": "Game Design",
            "design_goals": "Design Goals",
            "card1": {
                "title": "Sense of Accomplishment",
                "text": "For each order completed, we wish that player can feel sense of accomplishment by either revealing a new toy and enjoy the moment when the score grows exponentially."
            },
            "card2": {
            "title": "Non-trivial Solution",
            "text": "Players can build deceptive toy orders in multiple ways by recognizing their structure. A goose-like shape, for example, may be completed from the head, feet, or sides—allowing for flexible strategies and creative problem-solving."
            },
            "card3": {
                "title": "Speed and Skills",
                "text": "The game is designed to keep players engaged with its challenging puzzles and unique mechanics. Players will need to think critically and adapt to the game's challenges to progress."
            },
            "game_mechanics": "Game Mechanics"
        }, "game_ui" : {
            "ui1": {
                "title": "Menu Screen",
                "text": "The design principle of the menu screen aimed to create a lighthearted and cute vibe through a animated illustration. The animation is achieved through programming by changing the offsets of the UI elements with a osillation constant derived through sin/cos."
            },
            "ui2": {
                "title": "Transition",
                "text": "Since the background story is about delivery and package, delivery box opening/closing is a creative and interesting ways of transitiong between the screen. This also align with UI button in Level Selection which also is a delivery box."
            }, 
            "ui3": {
                "title": "Level Selection",
                "text": "Level selection page have a green/summer and a winter theme, this corresponded to different chapters, theme music represented in our game level. I designed it in a map scroller to invite players into the journey of Nox"
            },
            "game_mechanics": "Game Mechanics"
        },

        "game_mech": {
            "title1": "Recognize and Assemble the Shape",
            "text1": "Players must identify the anonymous shape displayed on the order board and assemble it using available enemies on the field.",
            
            "title2": "Color Matters",
            "text2": "Colors play an important role. Except for pink pieces, which act as erasers, each color grants different bonus points to the final order score once completed.",
            
            "title3": "Made a Mistake? Use Erasers",
            "text3": "Players can use erasers to correct misplaced pieces by throwing an eraser at the incorrect component."
        },"programming" : {
            "title": "Programming",
            "tech1": {
                "title": "Dependency Diagram",
                "text": "The architecture of Toymare strictly follows the Model-View-Control (MVC) practice in Software Engineering. We define all objects in the 'Model' section and resolve interactions between models in the 'Control' section."
            },
            "tech2": {
                "title": "Activity Diagram",
                "text": "The Activity Diagram displays the resonale of our main Control classes, which is Game Scene and Gameplay Controller."
            }, 
            "tech3": {
                "title": "Memory Management",
                "text": "Toymare utilize a built-in class and repertoire of resource managing using AssestsDirectory. All textures was initialized in the screen before each screen, and passed to the constructor of the next screen and the next screen will read from this assetsDirectory. All screens directory will correspondingly disposed when players exit the screen. This practice effectively optimize number of textures loaded at once and memory management when the game runs."
            },
            "tech4": {
                "title": "Tiled JSON Parsing",
                "text": "Tiled is an APP designed for level designs and map design for 2D games using tilesets. In Tiled, our grid is defined by 45 * 23 cells, we will be able to mark which cell are special blocks (obstacles, spawnpoints and mud). We transpose the level design in Tiled by the JSON file Tiled had provided to us. The function below extracts essential information from the Json and stored as a field in GameScene Class."
            }, 
            "tech5": {
                "title": "Animation through FSM and Bool Chain",
                "subtitle1": "Order Update Animation with FSM",
                "subtitle2": "Toy Complete Animation with Bool Chain",
                "text1": "This code implements a finite state machine (FSM) to manage the animation flow of an in-game 'order' object. The OrderState enum defines discrete animation states and the updateAnimation(float dt) method transitions between them based on timers, flags, and conditions. Each state encapsulates specific animation logic, such as flipping, playing sound effects, or applying interpolated visual offsets. This FSM approach ensures clear, modular control over complex sequential animations, enabling smooth and predictable state transitions in the UI or gameplay.",
                "text2": "This draw(SpriteBatch batch) method implements a sequential keyframe animation system using manual state flags and timers, simulating a mini finite state machine (FSM) for animating a 'combined toy' object. The animation progresses through four stages—shake, shrink-in, shrink-out, and bounce-back—each governed by its own timer and completion flag (shakeDone, shrinkInDone, etc.). The logic ensures smooth transitions through visual effects such as jittering, shrinking toward the center, expanding with sound feedback, and finally a bounce-back to resting scale. This fine-grained control enables expressive, multi-phase feedback upon toy combination, enhancing game feel and user satisfaction."
            },
            "game_mechanics": "Game Mechanics"
        }

    }
}
